rorke-time/experiment1-sriov-rorke-time/rorke150-memtier-250k.txt
Executing: memtier_benchmark -h 128.110.218.200 -p 11211 --ratio=1:10 --test-time=30 --rate-limiting=1250 -t 8 -c 25 --key-pattern=P:P --key-maximum 1000000 -P memcache_text
8         Threads
25        Connections per thread
30        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        19194.09          ---          ---         0.73435         0.54300         4.41500         7.83900      1291.24 
Gets       191903.41     76273.74    115629.67         0.72225         0.53500         4.38300         7.83900      9199.51 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     211097.50     76273.74    115629.67         0.72335         0.53500         4.38300         7.83900     10490.75 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.039        0.000
SET       0.247        5.000
SET       0.287       10.000
SET       0.311       15.000
SET       0.327       20.000
SET       0.351       25.000
SET       0.375       30.000
SET       0.407       35.000
SET       0.447       40.000
SET       0.495       45.000
SET       0.543       50.000
SET       0.567       52.500
SET       0.583       55.000
SET       0.599       57.500
SET       0.615       60.000
SET       0.639       62.500
SET       0.655       65.000
SET       0.687       67.500
SET       0.727       70.000
SET       0.767       72.500
SET       0.823       75.000
SET       0.847       76.250
SET       0.871       77.500
SET       0.895       78.750
SET       0.919       80.000
SET       0.943       81.250
SET       0.967       82.500
SET       1.007       83.750
SET       1.055       85.000
SET       1.111       86.250
SET       1.167       87.500
SET       1.199       88.125
SET       1.223       88.750
SET       1.247       89.375
SET       1.279       90.000
SET       1.319       90.625
SET       1.375       91.250
SET       1.431       91.875
SET       1.495       92.500
SET       1.551       93.125
SET       1.631       93.750
SET       1.679       94.062
SET       1.743       94.375
SET       1.799       94.688
SET       1.855       95.000
SET       1.927       95.312
SET       2.015       95.625
SET       2.127       95.938
SET       2.223       96.250
SET       2.367       96.562
SET       2.511       96.875
SET       2.607       97.031
SET       2.703       97.188
SET       2.799       97.344
SET       2.911       97.500
SET       3.039       97.656
SET       3.135       97.812
SET       3.279       97.969
SET       3.407       98.125
SET       3.551       98.281
SET       3.711       98.438
SET       3.791       98.516
SET       3.887       98.594
SET       3.983       98.672
SET       4.063       98.750
SET       4.191       98.828
SET       4.287       98.906
SET       4.383       98.984
SET       4.511       99.062
SET       4.639       99.141
SET       4.799       99.219
SET       4.863       99.258
SET       4.959       99.297
SET       5.023       99.336
SET       5.119       99.375
SET       5.215       99.414
SET       5.311       99.453
SET       5.407       99.492
SET       5.535       99.531
SET       5.663       99.570
SET       5.791       99.609
SET       5.887       99.629
SET       5.951       99.648
SET       6.047       99.668
SET       6.143       99.688
SET       6.239       99.707
SET       6.335       99.727
SET       6.463       99.746
SET       6.591       99.766
SET       6.719       99.785
SET       6.879       99.805
SET       6.943       99.814
SET       7.039       99.824
SET       7.135       99.834
SET       7.231       99.844
SET       7.295       99.854
SET       7.391       99.863
SET       7.455       99.873
SET       7.583       99.883
SET       7.711       99.893
SET       7.871       99.902
SET       7.967       99.907
SET       8.031       99.912
SET       8.159       99.917
SET       8.255       99.922
SET       8.319       99.927
SET       8.447       99.932
SET       8.575       99.937
SET       8.639       99.941
SET       8.767       99.946
SET       8.895       99.951
SET       8.959       99.954
SET       9.023       99.956
SET       9.087       99.958
SET       9.215       99.961
SET       9.279       99.963
SET       9.343       99.966
SET       9.407       99.968
SET       9.599       99.971
SET       9.663       99.973
SET       9.791       99.976
SET       9.919       99.977
SET       9.983       99.978
SET      10.047       99.979
SET      10.111       99.980
SET      10.111       99.982
SET      10.175       99.983
SET      10.239       99.984
SET      10.367       99.985
SET      10.431       99.987
SET      10.559       99.988
SET      10.559       99.988
SET      10.623       99.989
SET      10.623       99.990
SET      10.687       99.990
SET      10.815       99.991
SET      10.879       99.991
SET      11.007       99.992
SET      11.071       99.993
SET      11.135       99.993
SET      11.199       99.994
SET      11.199       99.994
SET      11.199       99.995
SET      11.263       99.995
SET      11.263       99.995
SET      11.391       99.995
SET      11.455       99.996
SET      11.455       99.996
SET      11.519       99.996
SET      11.583       99.997
SET      11.647       99.997
SET      11.711       99.997
SET      11.839       99.997
SET      11.839       99.997
SET      11.839       99.998
SET      11.903       99.998
SET      11.903       99.998
SET      11.967       99.998
SET      11.967       99.998
SET      12.031       99.998
SET      12.031       99.998
SET      12.031       99.999
SET      12.095       99.999
SET      12.095       99.999
SET      12.095       99.999
[...]
SET      12.159       99.999
SET      12.159       99.999
SET      12.415       99.999
SET      12.415       99.999
SET      12.415       99.999
SET      12.479       99.999
SET      12.479       99.999
SET      12.479       99.999
[...]
SET      12.543      100.000
SET      12.543      100.000
SET      12.543      100.000
[...]
SET      12.863      100.000
SET      12.863      100.000
SET      12.863      100.000
[...]
SET      13.503      100.000
SET      13.503      100.000
---
GET       0.039        0.000
GET       0.239        5.000
GET       0.279       10.000
GET       0.303       15.000
GET       0.327       20.000
GET       0.343       25.000
GET       0.367       30.000
GET       0.399       35.000
GET       0.439       40.000
GET       0.487       45.000
GET       0.535       50.000
GET       0.551       52.500
GET       0.575       55.000
GET       0.591       57.500
GET       0.607       60.000
GET       0.623       62.500
GET       0.647       65.000
GET       0.671       67.500
GET       0.703       70.000
GET       0.751       72.500
GET       0.799       75.000
GET       0.831       76.250
GET       0.855       77.500
GET       0.879       78.750
GET       0.903       80.000
GET       0.927       81.250
GET       0.951       82.500
GET       0.983       83.750
GET       1.031       85.000
GET       1.087       86.250
GET       1.143       87.500
GET       1.175       88.125
GET       1.207       88.750
GET       1.231       89.375
GET       1.263       90.000
GET       1.303       90.625
GET       1.351       91.250
GET       1.407       91.875
GET       1.479       92.500
GET       1.535       93.125
GET       1.607       93.750
GET       1.655       94.062
GET       1.711       94.375
GET       1.775       94.688
GET       1.839       95.000
GET       1.895       95.312
GET       1.991       95.625
GET       2.095       95.938
GET       2.191       96.250
GET       2.335       96.562
GET       2.479       96.875
GET       2.575       97.031
GET       2.671       97.188
GET       2.767       97.344
GET       2.879       97.500
GET       3.007       97.656
GET       3.119       97.812
GET       3.247       97.969
GET       3.391       98.125
GET       3.535       98.281
GET       3.695       98.438
GET       3.759       98.516
GET       3.855       98.594
GET       3.951       98.672
GET       4.047       98.750
GET       4.159       98.828
GET       4.255       98.906
GET       4.383       98.984
GET       4.511       99.062
GET       4.639       99.141
GET       4.767       99.219
GET       4.863       99.258
GET       4.927       99.297
GET       5.023       99.336
GET       5.119       99.375
GET       5.215       99.414
GET       5.311       99.453
GET       5.407       99.492
GET       5.535       99.531
GET       5.663       99.570
GET       5.823       99.609
GET       5.919       99.629
GET       5.983       99.648
GET       6.079       99.668
GET       6.175       99.688
GET       6.271       99.707
GET       6.367       99.727
GET       6.463       99.746
GET       6.591       99.766
GET       6.719       99.785
GET       6.879       99.805
GET       6.943       99.814
GET       7.007       99.824
GET       7.103       99.834
GET       7.199       99.844
GET       7.295       99.854
GET       7.391       99.863
GET       7.487       99.873
GET       7.615       99.883
GET       7.743       99.893
GET       7.871       99.902
GET       7.967       99.907
GET       8.031       99.912
GET       8.127       99.917
GET       8.255       99.922
GET       8.319       99.927
GET       8.383       99.932
GET       8.511       99.937
GET       8.639       99.941
GET       8.767       99.946
GET       8.895       99.951
GET       8.959       99.954
GET       9.023       99.956
GET       9.087       99.958
GET       9.215       99.961
GET       9.279       99.963
GET       9.343       99.966
GET       9.471       99.968
GET       9.535       99.971
GET       9.663       99.973
GET       9.791       99.976
GET       9.855       99.977
GET       9.919       99.978
GET       9.983       99.979
GET      10.047       99.980
GET      10.111       99.982
GET      10.239       99.983
GET      10.303       99.984
GET      10.431       99.985
GET      10.495       99.987
GET      10.623       99.988
GET      10.687       99.988
GET      10.751       99.989
GET      10.815       99.990
GET      10.879       99.990
GET      10.943       99.991
GET      11.007       99.991
GET      11.071       99.992
GET      11.135       99.993
GET      11.199       99.993
GET      11.327       99.994
GET      11.391       99.994
GET      11.391       99.995
GET      11.455       99.995
GET      11.519       99.995
GET      11.583       99.995
GET      11.583       99.996
GET      11.647       99.996
GET      11.711       99.996
GET      11.775       99.997
GET      11.839       99.997
GET      11.903       99.997
GET      11.903       99.997
GET      11.903       99.997
GET      11.967       99.998
GET      11.967       99.998
GET      12.031       99.998
GET      12.031       99.998
GET      12.095       99.998
GET      12.095       99.998
GET      12.159       99.998
GET      12.159       99.999
GET      12.223       99.999
GET      12.223       99.999
GET      12.223       99.999
GET      12.287       99.999
GET      12.287       99.999
GET      12.351       99.999
GET      12.351       99.999
GET      12.415       99.999
GET      12.479       99.999
GET      12.479       99.999
GET      12.543       99.999
GET      12.607       99.999
GET      12.607       99.999
GET      12.671       99.999
GET      12.671       99.999
GET      12.671      100.000
GET      12.671      100.000
GET      12.735      100.000
GET      12.735      100.000
GET      12.735      100.000
[...]
GET      12.799      100.000
GET      12.799      100.000
GET      12.863      100.000
GET      12.863      100.000
GET      12.927      100.000
GET      13.119      100.000
GET      13.119      100.000
GET      13.119      100.000
[...]
GET      13.247      100.000
GET      13.247      100.000
GET      13.247      100.000
[...]
GET      13.311      100.000
GET      13.311      100.000
GET      13.311      100.000
[...]
GET      13.375      100.000
GET      13.375      100.000
GET      13.375      100.000
[...]
GET      13.439      100.000
GET      13.439      100.000
GET      13.439      100.000
[...]
GET      13.631      100.000
GET      13.631      100.000
GET      13.631      100.000
[...]
GET      13.759      100.000
GET      13.759      100.000
---
WAIT      0.000      100.000